app/views/posts/index.html.erb

SELECT `posts`.* FROM `posts`
---
          <%= f.label :status_eq %>
          <%= f.select :status_eq, options_for_select(Post.statuses), class: "form-control" %>