app/controllers/galleries_controller.rb

  def create
    @gallery = current_photographer.galleries.build gallery_params
    if @gallery.save
---
INSERT INTO `galleries` (`title`, `photographer_id`, `created_at`, `updated_at`) VALUES ('Gallery 1', 1, '2019-02-15 09:13:39', '2019-02-15 09:13:39')

  def show
    @gallery = Gallery.find_by id: params[:id]
---
SELECT  `galleries`.* FROM `galleries` WHERE `galleries`.`id` = 1 LIMIT 1