app/controllers/posts_controller.rb

  def index
    if photographer_signed_in?
      @q = Post.available.latest.ransack params[:q]
---
SELECT `posts`.* FROM `posts`

  def create
    @post = current_customer.posts.build post_params
    if @post.save
---
INSERT INTO `posts` (`title`, `customer_id`, `hourly_rate`, `location`, `address`, `hire_date`, `created_at`, `updated_at`) VALUES ('Create first post', 12, 199, 'Hanoi', 'Cau giay 100', '2019-02-15', '2019-02-15 07:19:20', '2019-02-15 07:19:20')